---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RenderFailures
source: html/bc5428d4-330d-3bcc-7cf4-5778210cfa7b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RenderFailures

Failures related to rendering.

## Syntax (C#)
```csharp
public static class RenderFailures
```